Create an Employee Table with employee
name,employee ID & Salary

In [1]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="Prathu@123",
)

mycursor = mydb.cursor()
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001AC6211FDC0>

In [3]:
dbse = mydb.cursor()

dbse.execute("CREATE DATABASE Employee_Mangement_System")

In [5]:
mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="Prathu@123",
  database="Employee_Mangement_System"
)
dbse = mydb.cursor()

dbse.execute("CREATE TABLE Employee (EMP_ID INT , EMP_NAME VARCHAR(255),EMP_SALARY INT )")

In [3]:
import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="Prathu@123",
  database="Employee_Mangement_System"
)
dbse = mydb.cursor()

sql = "INSERT INTO employee (emp_id , EMP_NAME , EMP_SALARY) VALUES (%s,%s,%s)"
val = [
  ('1','SAROJ','10000.0'),
    ('2','ANUSHKA','16000.0'),
    ('3','PRIYANKA','77000.0'),
    ('4','VAIBHAV','81000.0'),
    ('5','ANAND','88000.0'),
    ('6','KHUSHBU','54000.0'),
    ('7','KIRAN','56000.0'),
    ('8','AMAN','47000.0'),
    ('9','MAYUR','26000.0'),
    ('10','ROHIT','15000.0'),
    ('11','LAKSHMAN','50000.0'),
    ('12','PRIT','40000.0'),
    ('13','MADHURI','25000.0'),
    ('14','POONAM','26000.0'),
    ('15','AKANSHA','100000.0')
       
]

dbse.executemany(sql, val)

mydb.commit()

print(dbse.rowcount, "was inserted.")

15 was inserted.

a) Write a query to get the maximum and minimum salary from employees table

In [14]:
import mysql.connector
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Prathu@123",
    database="Employee_Mangement_System"
)
db = mydb.cursor()
sql = "SELECT emp_name, emp_salary FROM employee WHERE emp_salary = (SELECT MIN(emp_salary) FROM employee)"
db.execute(sql)  
result = db.fetchall()
  
for x in result:
    print(x)

('SAROJ', 10000)

In [15]:
import mysql.connector
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Prathu@123",
    database="Employee_Mangement_System"
)
db = mydb.cursor()
sql = "SELECT emp_name, emp_salary FROM employee WHERE emp_salary = (SELECT MAX(emp_salary) FROM employee)"
db.execute(sql)  
result = db.fetchall()
  
for x in result:
    print(x)

('AKANSHA', 100000)

b) Write a query to get the number of employees working with the company

In [17]:
import mysql.connector
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Prathu@123",
    database="Employee_Mangement_System"
)
db = mydb.cursor()
sql = "SELECT COUNT(*) FROM employee"
db.execute(sql)  
result = db.fetchall()
  
for x in result:
    print(x)

(15,)

c) Write a query to get the first 3 characters of first name from employees table

In [18]:
import mysql.connector
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Prathu@123",
    database="Employee_Mangement_System"
)
db = mydb.cursor()
sql = "SELECT SUBSTRING(emp_name, 1, 3) FROM employee"
db.execute(sql)  
result = db.fetchall()
  
for x in result:
    print(x)

('SAR',)
('ANU',)
('PRI',)
('VAI',)
('ANA',)
('KHU',)
('KIR',)
('AMA',)
('MAY',)
('ROH',)
('LAK',)
('PRI',)
('MAD',)
('POO',)
('AKA',)